app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts"
---
  def index
    @TAX = 1.08    #税込価格計算用、税率8％
    @price = 0     #商品税込価格用
    @total = 0     #合計計算用初期化
    @client_user = current_client_user
    @carts = @client_user.carts

    @carts.each do |cart|