app/controllers/client_users_controller.rb

  def show
    @client_users = ClientUser.find(params[:id])
---
SELECT  "client_users".* FROM "client_users" WHERE "client_users"."id" = ? ORDER BY "client_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]