app/controllers/products_controller.rb

  def show
    @TAX = 1.08
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]